In [4]:
import numpy as np
import pandas as pd

import matplotlib
import matplotlib.pyplot as pp

%matplotlib inline

In [5]:
tb = pd.read_csv('tb.csv')

In [60]:
final = pd.read_csv('final.csv')

In [62]:
set(final['age'])

{'0-4', '15-24', '25-34', '35-44', '45-54', '5-14', '55-64', '65+', nan}

In [7]:
tb.columns

Index(['country', 'year', 'm04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
      dtype='object')

In [8]:
tbmelt = tb.melt(['country', 'year'], ['m04', 'm514', 'm014', 'm1524', 'm2534', 'm3544',
       'm4554', 'm5564', 'm65', 'mu', 'f04', 'f514', 'f014', 'f1524', 'f2534',
       'f3544', 'f4554', 'f5564', 'f65', 'fu'],
                   'age_gender', 'cases')

In [9]:
tbmelt.head()

  country  year age_gender  cases
0      AD  1989        m04    NaN
1      AD  1990        m04    NaN
2      AD  1991        m04    NaN
3      AD  1992        m04    NaN
4      AD  1993        m04    NaN

In [13]:
tbmelt.query('cases != "NaN"').head()

   country  year age_gender  cases
15      AD  2005        m04    0.0
16      AD  2006        m04    0.0
18      AD  2008        m04    0.0
42      AE  2006        m04    0.0
43      AE  2007        m04    0.0

In [43]:
tbmelt['sex'] = tbmelt['age_gender'].apply(lambda s: s[0])

In [92]:
tbmelt['age'] = tbmelt['age_gender'].apply(lambda i: i[1:3]+'-'+i[3:] if len(i[1:]) == 4 else 'nan' if i[1:] == 'u' else
                                           '65+' if i[1:] == '65' else i[1]+'-'+i[2:])

KeyError: 'age_gender'

an alternative would be to slice and map the value,
slicing involves three parameters start stop and step

melted['sex'] = melted['sexage'].str.slice(0,1)

melted['age'] = melted['sexage'].str.slice(1)

melted['age'] = melted['age'].map({'04': '0-4', '514': '5-14', 'u': np.nan, ...})

In [71]:
set(tbmelt['age'])

{'0-14',
 '0-4',
 '15-24',
 '25-34',
 '35-44',
 '45-54',
 '5-14',
 '55-64',
 '6-5',
 'nan'}

In [78]:
tbmelt.drop(['age_gender'], axis = 1, inplace = True)

In [80]:
tbmelt = tbmelt[['country','year','sex','age','cases']]

In [82]:
tbmelt.head()

  country  year sex  age  cases
0      AD  1989   m  0-4    NaN
1      AD  1990   m  0-4    NaN
2      AD  1991   m  0-4    NaN
3      AD  1992   m  0-4    NaN
4      AD  1993   m  0-4    NaN

In [83]:
final = tbmelt.dropna(subset = ['cases'])

In [84]:
final.head()

   country  year sex  age  cases
15      AD  2005   m  0-4    0.0
16      AD  2006   m  0-4    0.0
18      AD  2008   m  0-4    0.0
42      AE  2006   m  0-4    0.0
43      AE  2007   m  0-4    0.0

In [89]:
final.sort_values(['country','year','age','sex'])
final.head(20)

    country  year sex  age  cases
15       AD  2005   m  0-4    0.0
16       AD  2006   m  0-4    0.0
18       AD  2008   m  0-4    0.0
42       AE  2006   m  0-4    0.0
43       AE  2007   m  0-4    0.0
44       AE  2008   m  0-4    0.0
94       AG  2007   m  0-4    0.0
141      AL  2005   m  0-4    0.0
142      AL  2006   m  0-4    1.0
143      AL  2007   m  0-4    0.0
144      AL  2008   m  0-4    1.0
170      AM  2005   m  0-4    1.0
171      AM  2006   m  0-4    0.0
172      AM  2007   m  0-4    0.0
173      AM  2008   m  0-4    0.0
184      AN  2006   m  0-4    0.0
242      AR  2006   m  0-4   19.0
243      AR  2007   m  0-4   14.0
244      AR  2008   m  0-4   11.0
299      AT  2005   m  0-4    1.0

In [91]:
final.to_csv('final_practice_results.csv', index = False)